УНФ_ТЕСТ/src/Catalogs/ГрафикиРаботы/ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафикиРаботы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УдалитьТипГрафика</name>
    <type>
      <types>EnumRef.ТипыГрафикаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабочейНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаОтсчета</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКалендарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>EnumRef.СпособыЗаполненияГрафикаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПраздничныеДни</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьПериоды</name>
    <attributes>
      <name>НомерДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасписаниеРаботы</name>
    <attributes>
      <name>НомерДняЦикла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРабочихЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПерерывов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеньВключенВГрафик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Активность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Перерывы</name>
    <attributes>
      <name>НомерДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныПоГоду</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЗаполненияГрафика</name>
      <type>
        <types>CatalogRef.ШаблоныЗаполненияГрафиковРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтсчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипГрафика</name>
      <type>
        <types>EnumRef.ТипыГрафикаРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНастройкиЗаполнения</name>
    <attributes>
      <name>ЗначениеНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРабочихЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПерерывов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПериодыДополнительныхНастроекЗаполнения</name>
    <attributes>
      <name>ЗначениеНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовПерерывов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПериодыГрафика</name>
    <attributes>
      <name>НомерДняЦикла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовПерерывов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/ГрафикиРаботы/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, "Недействителен", Ложь, , , Истина);
	
	Если Параметры.Свойство("Подсистема") Тогда
		ТипПодсистемы = Параметры.Подсистема;
	Иначе
		ТипПодсистемы = 0;
		Элементы.ГруппаСущностиПоГрафику.Видимость = Ложь;
		Элементы.ОтборПографику.Видимость = Ложь;
	КонецЕсли;
	
	Если ТипПодсистемы = 2 Тогда
		СущностиПоГрафику.ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
		|	СотрудникиСрезПоследних.Сотрудник КАК РесурсПредприятия
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			,
		|			НЕ Сотрудник.Недействителен
		|				И НЕ ГрафикРаботы = ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)) КАК СотрудникиСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникиСрезПоследних.Сотрудник.Наименование";
		
		Элементы.СписокСотрудникиПоГрафикуРесурсПредприятия.Заголовок = "Сотрудники по графику";
		Элементы.ОтборПографику.Видимость = Ложь;
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПографикуПриИзменении(Элемент)
	
	УстановитьОтборПоГрафику();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СущностиПоГрафику, 
	"ГрафикРаботы",
	ТекущиеДанные.Ссылка,
	ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудникиПоГрафикуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СущностиПоГрафику.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.РесурсПредприятия) = Тип("СправочникСсылка.КлючевыеРесурсы") Тогда
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.РесурсПредприятия);
		ОткрытьФорму("Справочник.КлючевыеРесурсы.ФормаОбъекта",ПараметрыФормы);
	ИначеЕсли ТипЗнч(ТекущиеДанные.РесурсПредприятия) = Тип("СправочникСсылка.Сотрудники") Тогда
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.РесурсПредприятия);
		ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта",ПараметрыФормы);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.РесурсПредприятия);
		ОткрытьФорму("Справочник.Бригады.ФормаОбъекта",ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьНедействительную(Команда)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Недействителен");
	НайденныйЭлемент = Неопределено;
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора
			Тогда
			НайденныйЭлемент = ЭлементОтбора;
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлемент = Неопределено
		Тогда
		Возврат;
	КонецЕсли;
	
	НовыйОтбор = НайденныйЭлемент;
	НовыйОтбор.Использование = Не НовыйОтбор.Использование;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоГрафику()
	
	Если ОтборПоГрафику = "Сотрудники" Тогда
		Элементы.СущностиПоГрафикуРесурсПредприятия.Заголовок = "Сотрудники по графику";
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(СущностиПоГрафику, "ТипРесурса", 1, Истина, ВидСравненияКомпоновкиДанных.Равно);
	ИначеЕсли ОтборПоГрафику = "Бригады" Тогда
		Элементы.СущностиПоГрафикуРесурсПредприятия.Заголовок = "Бригады по графику";
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(СущностиПоГрафику, "ТипРесурса", 2, Истина, ВидСравненияКомпоновкиДанных.Равно);
	ИначеЕсли ОтборПоГрафику = "Ресурсы" Тогда
		Элементы.СущностиПоГрафикуРесурсПредприятия.Заголовок = "Ресурсы по графику";
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(СущностиПоГрафику, "ТипРесурса", 3, Истина, ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(СущностиПоГрафику, "ТипРесурса", 0, Ложь, ВидСравненияКомпоновкиДанных.Равно);
		Элементы.СущностиПоГрафикуРесурсПредприятия.Заголовок = "Все элементы по графику";
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.Недействителен", Истина, ВидСравненияКомпоновкиДанных.Равно);
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "Наименование");
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);

КонецПроцедуры

#КонецОбласти
